#define _CRT_SECURE_NO_WARNINGS
//编程题 / 2猴子选大王【RSBD2022】
//【问题描述】
//要从n只猴子中选出一位大王。它们决定使用下面的方法 :
//n只猴子围成—圈，从1到n顺序编号。从第q(q可以大于n，比如q = n + 1时，意味着从1开始）只猴子开始，从1到m报数，凡报到m的猴子退出竞选，下一次又从退出的那只猴子的下一只开始从1到m报数，直至剩下的最后一只为大王。请问最后哪只猴子被选为大王。
//	【输入形式】
//	控制台输入三个整数n, m, q。【输出形式】
//	输出最后选为大王的猴子编号。【样例输入】
//	74 3
//	【样例输出】
#include<stdio.h>
int main() {
	int n = 0, m = 0, q = 0,a[100],c=0,i=0,k=0;
	scanf("%d %d %d", &n, &m, &q);
	for (i = 1; i <= n; i++)
		a[i] = 0;
	c = n;
	if (q > n)
		i = q % n;
	else
		i = q;
	while (c > 1) {
		if (a[i] != -1)
			k++;
		if (k == m) {
			a[i] = -1; //退出竞选
			k = 0;
			c--;
		}
		i++;
		if (i == n + 1) 
			i = 1;
	}
	for (i = 1; i <= n; i++)
		if (a[i] == 0)
			printf("%d\n", i);
	return 0;
}